"""
Дана строка, состоящая из слов, разделенных пробелами. Определите, сколько в ней слов.
"""
text = input()
print(text.count(' ') + 1)
