"""
Дана строка. Замените в этой строке все цифры 1 на слово one.
"""

string = input()
print(string.replace('1', 'one'))
