"""
Дана строка. Удалите из этой строки все символы @.
"""

text = input()
print(text.replace('@', ''))
