"""
Дано натуральное число. Выведите его последнюю цифру.
"""

n = int(input())
print(n % 10)
