"""
Дано положительное двузначное число. Найдите число десятков в нем.
"""

n = int(input())
print(n // 10)
